app/controllers/page_controller.rb

SELECT  "urls".* FROM "urls"  WHERE "urls"."shorturl" = '?YmaCOg' LIMIT 1
---
  def index
    if params[:code].blank?
    else
      url = Url.find_by shorturl: params[:code]