app/controllers/shorturl_controller.rb

  def show
    inputUrl = request.query_string

    if inputUrl.blank?
      respond_to do |format|
         format.xml { render :xml => '<error>Invalid URL</error>' }
      end
      return
    end

    url = Url.find_by originalurl: inputUrl

    if url
      respond_to do |format|
         format.xml { render :xml => '<shorturl>'+Rails.configuration.ent_url_base + url.shorturl+'</shorturl>' }
      end
    else
      code = generateCode(6)

      @url = Url.create shorturl: code, originalurl: inputUrl
---
SELECT  "urls".* FROM "urls"  WHERE "urls"."originalurl" = 'www.baidu123.com' LIMIT 1
INSERT INTO "urls" ("created_at", "originalurl", "shorturl", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-02 15:18:13.630573"], ["originalurl", "www.baidu1234.com"], ["shorturl", "WXhzLV"], ["updated_at", "2014-09-02 15:18:13.630573"]]